In [1]:
import pandas as ku  #variabel
import numpy as cing

In [2]:
n_row = 5 # Buat dataframe baris x colomn = 5 x 5
n_col = 5
col = tuple('ABCDE') #untuk menamai kolom
df = ku.DataFrame(cing.random.randint(1, 10, size=(n_row, n_col)),# perintah untuk membuat objek database berupa angka acak dari 1 - 10 dan membuat baris dan kolom
                 columns=col) # perintah untuk menamai kolom

In [3]:
df.loc[:, ::-1] # perintah untuk membalik urutan dari ABCDE menjadi EDCBA

   E  D  C  B  A
0  7  4  1  9  9
1  6  2  7  8  8
2  1  4  4  5  5
3  4  8  3  9  3
4  1  4  9  6  4

In [4]:
df.loc[::-1] #perintah untuk membalik urutan baris dari 01234 menjadi 43210
             # ini code singkat panjangnya df.loc[::-1, :]

   A  B  C  D  E
4  4  6  9  4  1
3  3  9  3  8  4
2  5  5  4  4  1
1  8  8  7  2  6
0  9  9  1  4  7

In [5]:
df.loc[::-1].reset_index(drop=True) #perintah untuk membalik urutan seperti diatas dengan urutan baris 01234 tetap 01234

   A  B  C  D  E
0  4  6  9  4  1
1  3  9  3  8  4
2  5  5  4  4  1
3  8  8  7  2  6
4  9  9  1  4  7

In [6]:
n_row = 5   #membuat baris dan kolom 5 x 5
n_col = 5
col = tuple ('FGHIJ') #menamai kolom
df = ku.DataFrame(cing.random.randint(1, 10, size=(n_row, n_col)),# perintah membuat tabel 5 x 5 dengan nama kolom FGHIJ dengan isi anka random 1 - 10
                      columns = col) 
df

   F  G  H  I  J
0  3  8  8  5  5
1  4  2  2  3  3
2  8  9  7  5  3
3  2  8  8  6  9
4  4  7  7  8  4

In [7]:
df.rename(columns={'H':'kerja'}) #perintah untuk mengubah 1 nama kolom

   F  G  kerja  I  J
0  3  8      8  5  5
1  4  2      2  3  3
2  8  9      7  5  3
3  2  8      8  6  9
4  4  7      7  8  4

In [8]:
df.rename(columns={'F':'nama', 'G':'alamat', 'H':'kota'}) # sama kaya diatas cuman lebih banyak

   nama  alamat  kota  I  J
0     3       8     8  5  5
1     4       2     2  3  3
2     8       9     7  5  3
3     2       8     8  6  9
4     4       7     7  8  4

In [9]:
df = ku.util.testing.makeMissingDataframe().reset_index()#perintah untuk menghasilkan dataframe yang memiliki missing value dan mereset index menjadi index yang baru
df.head() # perintah untuk memunculkan index yang missing value 5 dari atas saja

C:\Users\ASUS\anaconda3\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

        index         A         B         C         D
0  8wPKfAfQbS       NaN  1.075877  0.625720 -1.127869
1  OlzHCnVbC8  0.610973 -1.241796 -1.462332  0.840396
2  dvAWdUe2pP -1.209233 -0.620083  0.914657  2.069014
3  1V6YnOJOti  0.546842       NaN  0.538687       NaN
4  wrlrrV48rs  0.277324  0.624389  0.359587  0.040520

In [10]:
df = df.rename(columns={'index':'L'}) #perintah untuk mengubah nama index menjadi L
df.head()

            L         A         B         C         D
0  8wPKfAfQbS       NaN  1.075877  0.625720 -1.127869
1  OlzHCnVbC8  0.610973 -1.241796 -1.462332  0.840396
2  dvAWdUe2pP -1.209233 -0.620083  0.914657  2.069014
3  1V6YnOJOti  0.546842       NaN  0.538687       NaN
4  wrlrrV48rs  0.277324  0.624389  0.359587  0.040520

In [11]:
df_backup = df.copy(deep=True) #perintah untuk mengcopy Dataframe diatas

In [12]:
df = df.dropna(axis='columns') #perintah untuk membuang setiap kolom yang mengandung missing value
df.head()

            L
0  8wPKfAfQbS
1  OlzHCnVbC8
2  dvAWdUe2pP
3  1V6YnOJOti
4  wrlrrV48rs

In [13]:
df = df_backup.copy(deep=True) #perintah untuk mengembalikan kondisi dataframe ke bentuk semula
df = df.dropna(axis='rows') #perintah untuk membuang setiap baris yang mengandung missing value
df.head

<bound method NDFrame.head of              L         A         B         C         D
1   OlzHCnVbC8  0.610973 -1.241796 -1.462332  0.840396
2   dvAWdUe2pP -1.209233 -0.620083  0.914657  2.069014
4   wrlrrV48rs  0.277324  0.624389  0.359587  0.040520
5   Occ7mo90ai -0.393249 -0.735166  0.394085  0.968324
6   msXTzXsvS6 -0.082969 -0.479828  1.421503  0.745052
7   T9VjbZxXsV -1.404387  1.293103 -0.469101  0.568859
8   BrUbc2oh7R  0.585881  0.970678 -0.044355  1.607610
9   bHagV9HyIW -1.116780 -0.734067  0.378388 -1.323377
10  TL1IAefb8c  0.204295 -2.124764 -0.903565 -0.518823
11  RgNNPcHJTj  1.098973 -0.897678  0.407177 -0.320500
13  so4FQZ5BTq  0.638738 -0.604610  1.810060  1.040468
15  RpuGjol94F  1.680566 -1.152457  1.496635 -1.084673
16  w5Pjyd3MXl -0.477837 -0.832184 -0.152579 -0.364088
17  ESxUCOtV9f -0.250434 -0.865492  2.135637 -1.522364
18  6ELgIBbqfn  1.190278 -0.937551 -0.942991 -0.322070
20  ROD89zmddT -0.038306 -0.776091  0.558710  1.100540
21  2RMU15mke3 -0.631818 -1.514600  3.368547 -0.431736
24  dRyNLGmdou -0.704179 -0.179293  0.106509  1.440629
25  TB5GSfWi0G -0.739066 -0.597890 -0.398184  1.067881
26  JggDb4CPw9 -0.057101  3.229943  0.564264  0.999726
27  e6D1Ex8vpC  0.141390  0.897602 -2.049062  1.079287>

In [14]:
df = df_backup.copy(deep=True) #perintah untuk mengembalikan kondisi dataframe ke bentuk semula
df.isna().mean() #perintah untuk mengembalikan setiap missing value di setiap dataframe dan mengkalkulasi rata rata yang dimiliki olrh setiap dataframe

L    0.000000
A    0.133333
B    0.100000
C    0.033333
D    0.133333
dtype: float64

In [16]:
treshold = len(df) * 0.9 #perintah untuk membuat batasan Dataframe yang menhilang setidaknya 90 %
df = df.dropna(thresh=treshold, axis='columns') #perintah untuk menghilangkan setiap missing value yang sudah diatas 90% di kolom
df.head()

            L         B         C
0  8wPKfAfQbS  1.075877  0.625720
1  OlzHCnVbC8 -1.241796 -1.462332
2  dvAWdUe2pP -0.620083  0.914657
3  1V6YnOJOti       NaN  0.538687
4  wrlrrV48rs  0.624389  0.359587

In [18]:
data = {'A': [15, 15, 18, cing.nan, 12], #pembuatan 2 kolom data
        'B': [15, 15, 18, cing.nan, 12]}
df = ku.DataFrame(data) #menampilkan data
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [19]:
df['A'] #pandas series

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [20]:
type(df['A']) #menampilkan tipe pandas

pandas.core.series.Series

In [21]:
type(df) #menampilkan tipe pandas

pandas.core.frame.DataFrame

In [22]:
df['A'] == df['B'] #perintah untuk memeriksa kesamaaan nilai

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [23]:
df['A'].equals(df['B']) #sama aja cuma beda cara dan jawaban

True

In [24]:
df1 = df.copy(deep = True) #df1 dan df akan menampung objek yang berbeda dari dataframe yang kondisinya sama
df.equals(df1)

True

In [25]:
df1 == df #sama aja tapi pake operasi ==

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

In [26]:
#kesimpulannya mending pake metode .equals dri pada == :D